Tekla Open API Reference for Tekla Structures 2025
EnvironmentFiles.GetMultiDirectoryFileList Method (List<String>, String)
 Gets a list of files with the given extension from the given search directories and from XS_FIRM, XS_PROJECT subdirectories.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<string> GetMultiDirectoryFileList(
	List<string> searchDirectories,
	string fileExtension
)
Public Shared Function GetMultiDirectoryFileList (
	searchDirectories As List(Of String),
	fileExtension As String
) As List(Of String)
Parameters
searchDirectories
Type: System.Collections.Generic.List<String>
The search directories to be used.
fileExtension
Type: System.String
The file extension to be used.
Return Value
Type: List<String>
A list of found file names without the file extension.
See Also
Reference
EnvironmentFiles Class
GetMultiDirectoryFileList Overload
Tekla.Structures.Dialog.UIControls Namespace